grevaillot/svd_tools/headers/STM32H7x7_CM7/rcc.h
#define RCC_PLLCKSELR_DIVM2_SHIFT		12
#define RCC_PLLCKSELR_DIVM2_MASK		0x3f
/** @defgroup rcc_pllckselr_divm2 DIVM2 Prescaler for PLL2
@{*/
/**@}*/


#define RCC_PLLCKSELR_DIVM1_SHIFT		4
#define RCC_PLLCKSELR_DIVM1_MASK		0x3f
/** @defgroup rcc_pllckselr_divm1 DIVM1 Prescaler for PLL1
@{*/
/**@}*/


#define RCC_PLLCKSELR_PLLSRC_SHIFT		0
#define RCC_PLLCKSELR_PLLSRC_MASK		0x03
/** @defgroup rcc_pllckselr_pllsrc PLLSRC DIVMx and PLLs clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllcfgr PLLCFGR RCC PLLs Configuration Register
@{*/

/** RCC_PLLCFGR_DIVR3EN PLL3 DIVR divider output enable **/
#define RCC_PLLCFGR_DIVR3EN		(1 << 24)
/** RCC_PLLCFGR_DIVQ3EN PLL3 DIVQ divider output enable **/
#define RCC_PLLCFGR_DIVQ3EN		(1 << 23)
/** RCC_PLLCFGR_DIVP3EN PLL3 DIVP divider output enable **/
#define RCC_PLLCFGR_DIVP3EN		(1 << 22)
/** RCC_PLLCFGR_DIVR2EN PLL2 DIVR divider output enable **/
#define RCC_PLLCFGR_DIVR2EN		(1 << 21)
/** RCC_PLLCFGR_DIVQ2EN PLL2 DIVQ divider output enable **/
#define RCC_PLLCFGR_DIVQ2EN		(1 << 20)
/** RCC_PLLCFGR_DIVP2EN PLL2 DIVP divider output enable **/
#define RCC_PLLCFGR_DIVP2EN		(1 << 19)
/** RCC_PLLCFGR_DIVR1EN PLL1 DIVR divider output enable **/
#define RCC_PLLCFGR_DIVR1EN		(1 << 18)
/** RCC_PLLCFGR_DIVQ1EN PLL1 DIVQ divider output enable **/
#define RCC_PLLCFGR_DIVQ1EN		(1 << 17)
/** RCC_PLLCFGR_DIVP1EN PLL1 DIVP divider output enable **/
#define RCC_PLLCFGR_DIVP1EN		(1 << 16)

#define RCC_PLLCFGR_PLL3RGE_SHIFT		10
#define RCC_PLLCFGR_PLL3RGE_MASK		0x03
/** @defgroup rcc_pllcfgr_pll3rge PLL3RGE PLL3 input frequency range
@{*/
/**@}*/

/** RCC_PLLCFGR_PLL3VCOSEL PLL3 VCO selection **/
#define RCC_PLLCFGR_PLL3VCOSEL		(1 << 9)
/** RCC_PLLCFGR_PLL3FRACEN PLL3 fractional latch enable **/
#define RCC_PLLCFGR_PLL3FRACEN		(1 << 8)

#define RCC_PLLCFGR_PLL2RGE_SHIFT		6
#define RCC_PLLCFGR_PLL2RGE_MASK		0x03
/** @defgroup rcc_pllcfgr_pll2rge PLL2RGE PLL2 input frequency range
@{*/
/**@}*/

/** RCC_PLLCFGR_PLL2VCOSEL PLL2 VCO selection **/
#define RCC_PLLCFGR_PLL2VCOSEL		(1 << 5)
/** RCC_PLLCFGR_PLL2FRACEN PLL2 fractional latch enable **/
#define RCC_PLLCFGR_PLL2FRACEN		(1 << 4)

#define RCC_PLLCFGR_PLL1RGE_SHIFT		2
#define RCC_PLLCFGR_PLL1RGE_MASK		0x03
/** @defgroup rcc_pllcfgr_pll1rge PLL1RGE PLL1 input frequency range
@{*/
/**@}*/

/** RCC_PLLCFGR_PLL1VCOSEL PLL1 VCO selection **/
#define RCC_PLLCFGR_PLL1VCOSEL		(1 << 1)
/** RCC_PLLCFGR_PLL1FRACEN PLL1 fractional latch enable **/
#define RCC_PLLCFGR_PLL1FRACEN		(1 << 0)

/**@}*/

/** @defgroup rcc_pll1divr PLL1DIVR RCC PLL1 Dividers Configuration Register
@{*/


#define RCC_PLL1DIVR_DIVR1_SHIFT		24
#define RCC_PLL1DIVR_DIVR1_MASK		0x7f
/** @defgroup rcc_pll1divr_divr1 DIVR1 PLL1 DIVR division factor
@{*/
/**@}*/


#define RCC_PLL1DIVR_DIVQ1_SHIFT		16
#define RCC_PLL1DIVR_DIVQ1_MASK		0x7f
/** @defgroup rcc_pll1divr_divq1 DIVQ1 PLL1 DIVQ division factor
@{*/
/**@}*/


#define RCC_PLL1DIVR_DIVP1_SHIFT		9
#define RCC_PLL1DIVR_DIVP1_MASK		0x7f
/** @defgroup rcc_pll1divr_divp1 DIVP1 PLL1 DIVP division factor
@{*/
/**@}*/


#define RCC_PLL1DIVR_DIVN1_SHIFT		0
#define RCC_PLL1DIVR_DIVN1_MASK		0x1ff
/** @defgroup rcc_pll1divr_divn1 DIVN1 Multiplication factor for PLL1 VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pll1fracr PLL1FRACR RCC PLL1 Fractional Divider Register
@{*/


#define RCC_PLL1FRACR_FRACN1_SHIFT		3
#define RCC_PLL1FRACR_FRACN1_MASK		0x1fff
/** @defgroup rcc_pll1fracr_fracn1 FRACN1 Fractional part of the multiplication factor for PLL1 VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pll2divr PLL2DIVR RCC PLL2 Dividers Configuration Register
@{*/


#define RCC_PLL2DIVR_DIVR1_SHIFT		24
#define RCC_PLL2DIVR_DIVR1_MASK		0x7f
/** @defgroup rcc_pll2divr_divr1 DIVR1 PLL1 DIVR division factor
@{*/
/**@}*/


#define RCC_PLL2DIVR_DIVQ1_SHIFT		16
#define RCC_PLL2DIVR_DIVQ1_MASK		0x7f
/** @defgroup rcc_pll2divr_divq1 DIVQ1 PLL1 DIVQ division factor
@{*/
/**@}*/


#define RCC_PLL2DIVR_DIVP1_SHIFT		9
#define RCC_PLL2DIVR_DIVP1_MASK		0x7f
/** @defgroup rcc_pll2divr_divp1 DIVP1 PLL1 DIVP division factor
@{*/
/**@}*/


#define RCC_PLL2DIVR_DIVN1_SHIFT		0
#define RCC_PLL2DIVR_DIVN1_MASK		0x1ff
/** @defgroup rcc_pll2divr_divn1 DIVN1 Multiplication factor for PLL1 VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pll2fracr PLL2FRACR RCC PLL2 Fractional Divider Register
@{*/


#define RCC_PLL2FRACR_FRACN2_SHIFT		3
#define RCC_PLL2FRACR_FRACN2_MASK		0x1fff
/** @defgroup rcc_pll2fracr_fracn2 FRACN2 Fractional part of the multiplication factor for PLL VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pll3divr PLL3DIVR RCC PLL3 Dividers Configuration Register
@{*/


#define RCC_PLL3DIVR_DIVR3_SHIFT		24
#define RCC_PLL3DIVR_DIVR3_MASK		0x7f
/** @defgroup rcc_pll3divr_divr3 DIVR3 PLL DIVR division factor
@{*/
/**@}*/


#define RCC_PLL3DIVR_DIVQ3_SHIFT		16
#define RCC_PLL3DIVR_DIVQ3_MASK		0x7f
/** @defgroup rcc_pll3divr_divq3 DIVQ3 PLL DIVQ division factor
@{*/
/**@}*/


#define RCC_PLL3DIVR_DIVP3_SHIFT		9
#define RCC_PLL3DIVR_DIVP3_MASK		0x7f
/** @defgroup rcc_pll3divr_divp3 DIVP3 PLL DIVP division factor
@{*/
/**@}*/


#define RCC_PLL3DIVR_DIVN3_SHIFT		0
#define RCC_PLL3DIVR_DIVN3_MASK		0x1ff
/** @defgroup rcc_pll3divr_divn3 DIVN3 Multiplication factor for PLL1 VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pll3fracr PLL3FRACR RCC PLL3 Fractional Divider Register
@{*/


#define RCC_PLL3FRACR_FRACN3_SHIFT		3
#define RCC_PLL3FRACR_FRACN3_MASK		0x1fff
/** @defgroup rcc_pll3fracr_fracn3 FRACN3 Fractional part of the multiplication factor for PLL3 VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d1ccipr D1CCIPR RCC Domain 1 Kernel Clock Configuration Register
@{*/


#define RCC_D1CCIPR_CKPERSRC_SHIFT		28
#define RCC_D1CCIPR_CKPERSRC_MASK		0x03
/** @defgroup rcc_d1ccipr_ckpersrc CKPERSRC per_ck clock source selection
@{*/
/**@}*/

/** RCC_D1CCIPR_SDMMCSRC SDMMC kernel clock source selection **/
#define RCC_D1CCIPR_SDMMCSRC		(1 << 16)
/** RCC_D1CCIPR_DSISEL kernel clock source selection **/
#define RCC_D1CCIPR_DSISEL		(1 << 8)

#define RCC_D1CCIPR_QSPISRC_SHIFT		4
#define RCC_D1CCIPR_QSPISRC_MASK		0x03
/** @defgroup rcc_d1ccipr_qspisrc QSPISRC QUADSPI kernel clock source selection
@{*/
/**@}*/


