grevaillot/svd_tools/headers/STM32H7x7_CM7/rcc.h
#define RCC_D1CCIPR_FMCSRC_SHIFT		0
#define RCC_D1CCIPR_FMCSRC_MASK		0x03
/** @defgroup rcc_d1ccipr_fmcsrc FMCSRC FMC kernel clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d2ccip1r D2CCIP1R RCC Domain 2 Kernel Clock Configuration Register
@{*/

/** RCC_D2CCIP1R_SWPSRC SWPMI kernel clock source selection **/
#define RCC_D2CCIP1R_SWPSRC		(1 << 31)

#define RCC_D2CCIP1R_FDCANSRC_SHIFT		28
#define RCC_D2CCIP1R_FDCANSRC_MASK		0x03
/** @defgroup rcc_d2ccip1r_fdcansrc FDCANSRC FDCAN kernel clock source selection
@{*/
/**@}*/

/** RCC_D2CCIP1R_DFSDM1SRC DFSDM1 kernel Clk clock source selection **/
#define RCC_D2CCIP1R_DFSDM1SRC		(1 << 24)

#define RCC_D2CCIP1R_SPDIFSRC_SHIFT		20
#define RCC_D2CCIP1R_SPDIFSRC_MASK		0x03
/** @defgroup rcc_d2ccip1r_spdifsrc SPDIFSRC SPDIFRX kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP1R_SPI45SRC_SHIFT		16
#define RCC_D2CCIP1R_SPI45SRC_MASK		0x07
/** @defgroup rcc_d2ccip1r_spi45src SPI45SRC SPI4 and 5 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP1R_SPI123SRC_SHIFT		12
#define RCC_D2CCIP1R_SPI123SRC_MASK		0x07
/** @defgroup rcc_d2ccip1r_spi123src SPI123SRC SPI/I2S1,2 and 3 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP1R_SAI23SRC_SHIFT		6
#define RCC_D2CCIP1R_SAI23SRC_MASK		0x07
/** @defgroup rcc_d2ccip1r_sai23src SAI23SRC SAI2 and SAI3 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP1R_SAI1SRC_SHIFT		0
#define RCC_D2CCIP1R_SAI1SRC_MASK		0x07
/** @defgroup rcc_d2ccip1r_sai1src SAI1SRC SAI1 and DFSDM1 kernel Aclk clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d2ccip2r D2CCIP2R RCC Domain 2 Kernel Clock Configuration Register
@{*/


#define RCC_D2CCIP2R_LPTIM1SRC_SHIFT		28
#define RCC_D2CCIP2R_LPTIM1SRC_MASK		0x07
/** @defgroup rcc_d2ccip2r_lptim1src LPTIM1SRC LPTIM1 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_CECSRC_SHIFT		22
#define RCC_D2CCIP2R_CECSRC_MASK		0x03
/** @defgroup rcc_d2ccip2r_cecsrc CECSRC HDMI-CEC kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_USBSRC_SHIFT		20
#define RCC_D2CCIP2R_USBSRC_MASK		0x03
/** @defgroup rcc_d2ccip2r_usbsrc USBSRC USBOTG 1 and 2 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_I2C123SRC_SHIFT		12
#define RCC_D2CCIP2R_I2C123SRC_MASK		0x03
/** @defgroup rcc_d2ccip2r_i2c123src I2C123SRC I2C1,2,3 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_RNGSRC_SHIFT		8
#define RCC_D2CCIP2R_RNGSRC_MASK		0x03
/** @defgroup rcc_d2ccip2r_rngsrc RNGSRC RNG kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_USART16SRC_SHIFT		3
#define RCC_D2CCIP2R_USART16SRC_MASK		0x07
/** @defgroup rcc_d2ccip2r_usart16src USART16SRC USART1 and 6 kernel clock source selection
@{*/
/**@}*/


#define RCC_D2CCIP2R_USART234578SRC_SHIFT		0
#define RCC_D2CCIP2R_USART234578SRC_MASK		0x07
/** @defgroup rcc_d2ccip2r_usart234578src USART234578SRC USART2/3, UART4,5, 7/8 (APB1) kernel clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_d3ccipr D3CCIPR RCC Domain 3 Kernel Clock Configuration Register
@{*/


#define RCC_D3CCIPR_SPI6SRC_SHIFT		28
#define RCC_D3CCIPR_SPI6SRC_MASK		0x07
/** @defgroup rcc_d3ccipr_spi6src SPI6SRC SPI6 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_SAI4BSRC_SHIFT		24
#define RCC_D3CCIPR_SAI4BSRC_MASK		0x07
/** @defgroup rcc_d3ccipr_sai4bsrc SAI4BSRC Sub-Block B of SAI4 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_SAI4ASRC_SHIFT		21
#define RCC_D3CCIPR_SAI4ASRC_MASK		0x07
/** @defgroup rcc_d3ccipr_sai4asrc SAI4ASRC Sub-Block A of SAI4 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_ADCSRC_SHIFT		16
#define RCC_D3CCIPR_ADCSRC_MASK		0x03
/** @defgroup rcc_d3ccipr_adcsrc ADCSRC SAR ADC kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_LPTIM345SRC_SHIFT		13
#define RCC_D3CCIPR_LPTIM345SRC_MASK		0x07
/** @defgroup rcc_d3ccipr_lptim345src LPTIM345SRC LPTIM3,4,5 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_LPTIM2SRC_SHIFT		10
#define RCC_D3CCIPR_LPTIM2SRC_MASK		0x07
/** @defgroup rcc_d3ccipr_lptim2src LPTIM2SRC LPTIM2 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_I2C4SRC_SHIFT		8
#define RCC_D3CCIPR_I2C4SRC_MASK		0x03
/** @defgroup rcc_d3ccipr_i2c4src I2C4SRC I2C4 kernel clock source selection
@{*/
/**@}*/


#define RCC_D3CCIPR_LPUART1SRC_SHIFT		0
#define RCC_D3CCIPR_LPUART1SRC_MASK		0x07
/** @defgroup rcc_d3ccipr_lpuart1src LPUART1SRC LPUART1 kernel clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_cier CIER RCC Clock Source Interrupt Enable Register
@{*/

/** RCC_CIER_LSECSSIE LSE clock security system Interrupt Enable **/
#define RCC_CIER_LSECSSIE		(1 << 9)
/** RCC_CIER_PLL3RDYIE PLL3 ready Interrupt Enable **/
#define RCC_CIER_PLL3RDYIE		(1 << 8)
/** RCC_CIER_PLL2RDYIE PLL2 ready Interrupt Enable **/
#define RCC_CIER_PLL2RDYIE		(1 << 7)
/** RCC_CIER_PLL1RDYIE PLL1 ready Interrupt Enable **/
#define RCC_CIER_PLL1RDYIE		(1 << 6)
/** RCC_CIER_RC48RDYIE RC48 ready Interrupt Enable **/
#define RCC_CIER_RC48RDYIE		(1 << 5)
/** RCC_CIER_CSIRDYIE CSI ready Interrupt Enable **/
#define RCC_CIER_CSIRDYIE		(1 << 4)
/** RCC_CIER_HSERDYIE HSE ready Interrupt Enable **/
#define RCC_CIER_HSERDYIE		(1 << 3)
/** RCC_CIER_HSIRDYIE HSI ready Interrupt Enable **/
#define RCC_CIER_HSIRDYIE		(1 << 2)
/** RCC_CIER_LSERDYIE LSE ready Interrupt Enable **/
#define RCC_CIER_LSERDYIE		(1 << 1)
/** RCC_CIER_LSIRDYIE LSI ready Interrupt Enable **/
#define RCC_CIER_LSIRDYIE		(1 << 0)

/**@}*/

/** @defgroup rcc_cifr CIFR RCC Clock Source Interrupt Flag Register
@{*/

/** RCC_CIFR_HSECSSF HSE clock security system Interrupt Flag **/
#define RCC_CIFR_HSECSSF		(1 << 10)
/** RCC_CIFR_LSECSSF LSE clock security system Interrupt Flag **/
#define RCC_CIFR_LSECSSF		(1 << 9)
/** RCC_CIFR_PLL3RDYF PLL3 ready Interrupt Flag **/
#define RCC_CIFR_PLL3RDYF		(1 << 8)
/** RCC_CIFR_PLL2RDYF PLL2 ready Interrupt Flag **/
#define RCC_CIFR_PLL2RDYF		(1 << 7)
/** RCC_CIFR_PLL1RDYF PLL1 ready Interrupt Flag **/
#define RCC_CIFR_PLL1RDYF		(1 << 6)
/** RCC_CIFR_RC48RDYF RC48 ready Interrupt Flag **/
#define RCC_CIFR_RC48RDYF		(1 << 5)
/** RCC_CIFR_CSIRDY CSI ready Interrupt Flag **/
#define RCC_CIFR_CSIRDY		(1 << 4)
/** RCC_CIFR_HSERDYF HSE ready Interrupt Flag **/
#define RCC_CIFR_HSERDYF		(1 << 3)
/** RCC_CIFR_HSIRDYF HSI ready Interrupt Flag **/
#define RCC_CIFR_HSIRDYF		(1 << 2)
/** RCC_CIFR_LSERDYF LSE ready Interrupt Flag **/
#define RCC_CIFR_LSERDYF		(1 << 1)
/** RCC_CIFR_LSIRDYF LSI ready Interrupt Flag **/
#define RCC_CIFR_LSIRDYF		(1 << 0)

/**@}*/

