grevaillot/svd_tools/headers/STM32H7x7_CM7/rcc.h
/** @defgroup rcc_ahb2enr AHB2ENR RCC AHB2 Clock Register
@{*/

/** RCC_AHB2ENR_SRAM3EN SRAM3 block enable **/
#define RCC_AHB2ENR_SRAM3EN		(1 << 31)
/** RCC_AHB2ENR_SRAM2EN SRAM2 block enable **/
#define RCC_AHB2ENR_SRAM2EN		(1 << 30)
/** RCC_AHB2ENR_SRAM1EN SRAM1 block enable **/
#define RCC_AHB2ENR_SRAM1EN		(1 << 29)
/** RCC_AHB2ENR_SDMMC2EN SDMMC2 and SDMMC2 delay clock enable **/
#define RCC_AHB2ENR_SDMMC2EN		(1 << 9)
/** RCC_AHB2ENR_RNGEN RNG peripheral clocks enable **/
#define RCC_AHB2ENR_RNGEN		(1 << 6)
/** RCC_AHB2ENR_HASHEN HASH peripheral clock enable **/
#define RCC_AHB2ENR_HASHEN		(1 << 5)
/** RCC_AHB2ENR_CRYPTEN CRYPT peripheral clock enable **/
#define RCC_AHB2ENR_CRYPTEN		(1 << 4)
/** RCC_AHB2ENR_CAMITFEN CAMITF peripheral clock enable **/
#define RCC_AHB2ENR_CAMITFEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb4enr AHB4ENR RCC AHB4 Clock Register
@{*/

/** RCC_AHB4ENR_BKPRAMEN Backup RAM Clock Enable **/
#define RCC_AHB4ENR_BKPRAMEN		(1 << 28)
/** RCC_AHB4ENR_HSEMEN HSEM peripheral clock enable **/
#define RCC_AHB4ENR_HSEMEN		(1 << 25)
/** RCC_AHB4ENR_ADC3EN ADC3 Peripheral Clocks Enable **/
#define RCC_AHB4ENR_ADC3EN		(1 << 24)
/** RCC_AHB4ENR_BDMAEN BDMA and DMAMUX2 Clock Enable **/
#define RCC_AHB4ENR_BDMAEN		(1 << 21)
/** RCC_AHB4ENR_CRCEN CRC peripheral clock enable **/
#define RCC_AHB4ENR_CRCEN		(1 << 19)
/** RCC_AHB4ENR_GPIOKEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIOKEN		(1 << 10)
/** RCC_AHB4ENR_GPIOJEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIOJEN		(1 << 9)
/** RCC_AHB4ENR_GPIOIEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIOIEN		(1 << 8)
/** RCC_AHB4ENR_GPIOHEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIOHEN		(1 << 7)
/** RCC_AHB4ENR_GPIOGEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIOGEN		(1 << 6)
/** RCC_AHB4ENR_GPIOFEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIOFEN		(1 << 5)
/** RCC_AHB4ENR_GPIOEEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIOEEN		(1 << 4)
/** RCC_AHB4ENR_GPIODEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIODEN		(1 << 3)
/** RCC_AHB4ENR_GPIOCEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIOCEN		(1 << 2)
/** RCC_AHB4ENR_GPIOBEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIOBEN		(1 << 1)
/** RCC_AHB4ENR_GPIOAEN 0GPIO peripheral clock enable **/
#define RCC_AHB4ENR_GPIOAEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb3enr APB3ENR RCC APB3 Clock Register
@{*/

/** RCC_APB3ENR_WWDG1EN WWDG1 Clock Enable **/
#define RCC_APB3ENR_WWDG1EN		(1 << 6)
/** RCC_APB3ENR_DSIEN DSI Peripheral Clocks Enable **/
#define RCC_APB3ENR_DSIEN		(1 << 4)
/** RCC_APB3ENR_LTDCEN LTDC peripheral clock enable **/
#define RCC_APB3ENR_LTDCEN		(1 << 3)

/**@}*/

/** @defgroup rcc_apb1lenr APB1LENR RCC APB1 Clock Register
@{*/

/** RCC_APB1LENR_USART8EN USART8 Peripheral Clocks Enable **/
#define RCC_APB1LENR_USART8EN		(1 << 31)
/** RCC_APB1LENR_USART7EN USART7 Peripheral Clocks Enable **/
#define RCC_APB1LENR_USART7EN		(1 << 30)
/** RCC_APB1LENR_DAC12EN DAC1&2 peripheral clock enable **/
#define RCC_APB1LENR_DAC12EN		(1 << 29)
/** RCC_APB1LENR_HDMICECEN HDMI-CEC peripheral clock enable **/
#define RCC_APB1LENR_HDMICECEN		(1 << 27)
/** RCC_APB1LENR_I2C3EN I2C3 Peripheral Clocks Enable **/
#define RCC_APB1LENR_I2C3EN		(1 << 23)
/** RCC_APB1LENR_I2C2EN I2C2 Peripheral Clocks Enable **/
#define RCC_APB1LENR_I2C2EN		(1 << 22)
/** RCC_APB1LENR_I2C1EN I2C1 Peripheral Clocks Enable **/
#define RCC_APB1LENR_I2C1EN		(1 << 21)
/** RCC_APB1LENR_UART5EN UART5 Peripheral Clocks Enable **/
#define RCC_APB1LENR_UART5EN		(1 << 20)
/** RCC_APB1LENR_UART4EN UART4 Peripheral Clocks Enable **/
#define RCC_APB1LENR_UART4EN		(1 << 19)
/** RCC_APB1LENR_USART3EN USART3 Peripheral Clocks Enable **/
#define RCC_APB1LENR_USART3EN		(1 << 18)
/** RCC_APB1LENR_USART2EN USART2 Peripheral Clocks Enable **/
#define RCC_APB1LENR_USART2EN		(1 << 17)
/** RCC_APB1LENR_SPDIFRXEN SPDIFRX Peripheral Clocks Enable **/
#define RCC_APB1LENR_SPDIFRXEN		(1 << 16)
/** RCC_APB1LENR_SPI3EN SPI3 Peripheral Clocks Enable **/
#define RCC_APB1LENR_SPI3EN		(1 << 15)
/** RCC_APB1LENR_SPI2EN SPI2 Peripheral Clocks Enable **/
#define RCC_APB1LENR_SPI2EN		(1 << 14)
/** RCC_APB1LENR_WWDG2EN WWDG2 peripheral clock enable **/
#define RCC_APB1LENR_WWDG2EN		(1 << 11)
/** RCC_APB1LENR_LPTIM1EN LPTIM1 Peripheral Clocks Enable **/
#define RCC_APB1LENR_LPTIM1EN		(1 << 9)
/** RCC_APB1LENR_TIM14EN TIM peripheral clock enable **/
#define RCC_APB1LENR_TIM14EN		(1 << 8)
/** RCC_APB1LENR_TIM13EN TIM peripheral clock enable **/
#define RCC_APB1LENR_TIM13EN		(1 << 7)
/** RCC_APB1LENR_TIM12EN TIM peripheral clock enable **/
#define RCC_APB1LENR_TIM12EN		(1 << 6)
/** RCC_APB1LENR_TIM7EN TIM peripheral clock enable **/
#define RCC_APB1LENR_TIM7EN		(1 << 5)
/** RCC_APB1LENR_TIM6EN TIM peripheral clock enable **/
#define RCC_APB1LENR_TIM6EN		(1 << 4)
/** RCC_APB1LENR_TIM5EN TIM peripheral clock enable **/
#define RCC_APB1LENR_TIM5EN		(1 << 3)
/** RCC_APB1LENR_TIM4EN TIM peripheral clock enable **/
#define RCC_APB1LENR_TIM4EN		(1 << 2)
/** RCC_APB1LENR_TIM3EN TIM peripheral clock enable **/
#define RCC_APB1LENR_TIM3EN		(1 << 1)
/** RCC_APB1LENR_TIM2EN TIM peripheral clock enable **/
#define RCC_APB1LENR_TIM2EN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1henr APB1HENR RCC APB1 Clock Register
@{*/

/** RCC_APB1HENR_FDCANEN FDCAN Peripheral Clocks Enable **/
#define RCC_APB1HENR_FDCANEN		(1 << 8)
/** RCC_APB1HENR_MDIOSEN MDIOS peripheral clock enable **/
#define RCC_APB1HENR_MDIOSEN		(1 << 5)
/** RCC_APB1HENR_OPAMPEN OPAMP peripheral clock enable **/
#define RCC_APB1HENR_OPAMPEN		(1 << 4)
/** RCC_APB1HENR_SWPEN SWPMI Peripheral Clocks Enable **/
#define RCC_APB1HENR_SWPEN		(1 << 2)
/** RCC_APB1HENR_CRSEN Clock Recovery System peripheral clock enable **/
#define RCC_APB1HENR_CRSEN		(1 << 1)

/**@}*/

/** @defgroup rcc_apb2enr APB2ENR RCC APB2 Clock Register
@{*/

/** RCC_APB2ENR_HRTIMEN HRTIM peripheral clock enable **/
#define RCC_APB2ENR_HRTIMEN		(1 << 29)
/** RCC_APB2ENR_DFSDM1EN DFSDM1 Peripheral Clocks Enable **/
#define RCC_APB2ENR_DFSDM1EN		(1 << 28)
/** RCC_APB2ENR_SAI3EN SAI3 Peripheral Clocks Enable **/
#define RCC_APB2ENR_SAI3EN		(1 << 24)
/** RCC_APB2ENR_SAI2EN SAI2 Peripheral Clocks Enable **/
#define RCC_APB2ENR_SAI2EN		(1 << 23)
/** RCC_APB2ENR_SAI1EN SAI1 Peripheral Clocks Enable **/
#define RCC_APB2ENR_SAI1EN		(1 << 22)
/** RCC_APB2ENR_SPI5EN SPI5 Peripheral Clocks Enable **/
#define RCC_APB2ENR_SPI5EN		(1 << 20)
/** RCC_APB2ENR_TIM17EN TIM17 peripheral clock enable **/
#define RCC_APB2ENR_TIM17EN		(1 << 18)
/** RCC_APB2ENR_TIM16EN TIM16 peripheral clock enable **/
#define RCC_APB2ENR_TIM16EN		(1 << 17)
/** RCC_APB2ENR_TIM15EN TIM15 peripheral clock enable **/
#define RCC_APB2ENR_TIM15EN		(1 << 16)
/** RCC_APB2ENR_SPI4EN SPI4 Peripheral Clocks Enable **/
#define RCC_APB2ENR_SPI4EN		(1 << 13)
/** RCC_APB2ENR_SPI1EN SPI1 Peripheral Clocks Enable **/
#define RCC_APB2ENR_SPI1EN		(1 << 12)
/** RCC_APB2ENR_USART6EN USART6 Peripheral Clocks Enable **/
#define RCC_APB2ENR_USART6EN		(1 << 5)
/** RCC_APB2ENR_USART1EN USART1 Peripheral Clocks Enable **/
#define RCC_APB2ENR_USART1EN		(1 << 4)
/** RCC_APB2ENR_TIM8EN TIM8 peripheral clock enable **/
#define RCC_APB2ENR_TIM8EN		(1 << 1)
/** RCC_APB2ENR_TIM1EN TIM1 peripheral clock enable **/
#define RCC_APB2ENR_TIM1EN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb4enr APB4ENR RCC APB4 Clock Register
@{*/

