grevaillot/svd_tools/headers/STM32H7x7_CM7/rcc.h
/** @defgroup rcc_apb3lpenr APB3LPENR RCC APB3 Sleep Clock Register
@{*/

/** RCC_APB3LPENR_WWDG1LPEN WWDG1 Clock Enable During CSleep Mode **/
#define RCC_APB3LPENR_WWDG1LPEN		(1 << 6)
/** RCC_APB3LPENR_DSILPEN DSI peripheral clock enable during CSleep mode **/
#define RCC_APB3LPENR_DSILPEN		(1 << 4)
/** RCC_APB3LPENR_LTDCLPEN LTDC peripheral clock enable during CSleep mode **/
#define RCC_APB3LPENR_LTDCLPEN		(1 << 3)

/**@}*/

/** @defgroup rcc_apb1llpenr APB1LLPENR RCC APB1 Low Sleep Clock Register
@{*/

/** RCC_APB1LLPENR_USART8LPEN USART8 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_USART8LPEN		(1 << 31)
/** RCC_APB1LLPENR_USART7LPEN USART7 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_USART7LPEN		(1 << 30)
/** RCC_APB1LLPENR_DAC12LPEN DAC1/2 peripheral clock enable during CSleep mode **/
#define RCC_APB1LLPENR_DAC12LPEN		(1 << 29)
/** RCC_APB1LLPENR_HDMICECLPEN HDMI-CEC Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_HDMICECLPEN		(1 << 27)
/** RCC_APB1LLPENR_I2C3LPEN I2C3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_I2C3LPEN		(1 << 23)
/** RCC_APB1LLPENR_I2C2LPEN I2C2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_I2C2LPEN		(1 << 22)
/** RCC_APB1LLPENR_I2C1LPEN I2C1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_I2C1LPEN		(1 << 21)
/** RCC_APB1LLPENR_UART5LPEN UART5 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_UART5LPEN		(1 << 20)
/** RCC_APB1LLPENR_UART4LPEN UART4 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_UART4LPEN		(1 << 19)
/** RCC_APB1LLPENR_USART3LPEN USART3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_USART3LPEN		(1 << 18)
/** RCC_APB1LLPENR_USART2LPEN USART2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_USART2LPEN		(1 << 17)
/** RCC_APB1LLPENR_SPDIFRXLPEN SPDIFRX Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_SPDIFRXLPEN		(1 << 16)
/** RCC_APB1LLPENR_SPI3LPEN SPI3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_SPI3LPEN		(1 << 15)
/** RCC_APB1LLPENR_SPI2LPEN SPI2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_SPI2LPEN		(1 << 14)
/** RCC_APB1LLPENR_WWDG2LPEN WWDG2 Clock Enable During CSleep Mode **/
#define RCC_APB1LLPENR_WWDG2LPEN		(1 << 11)
/** RCC_APB1LLPENR_LPTIM1LPEN LPTIM1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1LLPENR_LPTIM1LPEN		(1 << 9)
/** RCC_APB1LLPENR_TIM14LPEN TIM14 peripheral clock enable during CSleep mode **/
#define RCC_APB1LLPENR_TIM14LPEN		(1 << 8)
/** RCC_APB1LLPENR_TIM13LPEN TIM13 peripheral clock enable during CSleep mode **/
#define RCC_APB1LLPENR_TIM13LPEN		(1 << 7)
/** RCC_APB1LLPENR_TIM12LPEN TIM12 peripheral clock enable during CSleep mode **/
#define RCC_APB1LLPENR_TIM12LPEN		(1 << 6)
/** RCC_APB1LLPENR_TIM7LPEN TIM7 peripheral clock enable during CSleep mode **/
#define RCC_APB1LLPENR_TIM7LPEN		(1 << 5)
/** RCC_APB1LLPENR_TIM6LPEN TIM6 peripheral clock enable during CSleep mode **/
#define RCC_APB1LLPENR_TIM6LPEN		(1 << 4)
/** RCC_APB1LLPENR_TIM5LPEN TIM5 peripheral clock enable during CSleep mode **/
#define RCC_APB1LLPENR_TIM5LPEN		(1 << 3)
/** RCC_APB1LLPENR_TIM4LPEN TIM4 peripheral clock enable during CSleep mode **/
#define RCC_APB1LLPENR_TIM4LPEN		(1 << 2)
/** RCC_APB1LLPENR_TIM3LPEN TIM3 peripheral clock enable during CSleep mode **/
#define RCC_APB1LLPENR_TIM3LPEN		(1 << 1)
/** RCC_APB1LLPENR_TIM2LPEN TIM2 peripheral clock enable during CSleep mode **/
#define RCC_APB1LLPENR_TIM2LPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1hlpenr APB1HLPENR RCC APB1 High Sleep Clock Register
@{*/

/** RCC_APB1HLPENR_FDCANLPEN FDCAN Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1HLPENR_FDCANLPEN		(1 << 8)
/** RCC_APB1HLPENR_MDIOSLPEN MDIOS peripheral clock enable during CSleep mode **/
#define RCC_APB1HLPENR_MDIOSLPEN		(1 << 5)
/** RCC_APB1HLPENR_OPAMPLPEN OPAMP peripheral clock enable during CSleep mode **/
#define RCC_APB1HLPENR_OPAMPLPEN		(1 << 4)
/** RCC_APB1HLPENR_SWPLPEN SWPMI Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB1HLPENR_SWPLPEN		(1 << 2)
/** RCC_APB1HLPENR_CRSLPEN Clock Recovery System peripheral clock enable during CSleep mode **/
#define RCC_APB1HLPENR_CRSLPEN		(1 << 1)

/**@}*/

/** @defgroup rcc_apb2lpenr APB2LPENR RCC APB2 Sleep Clock Register
@{*/

/** RCC_APB2LPENR_HRTIMLPEN HRTIM peripheral clock enable during CSleep mode **/
#define RCC_APB2LPENR_HRTIMLPEN		(1 << 29)
/** RCC_APB2LPENR_DFSDM1LPEN DFSDM1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB2LPENR_DFSDM1LPEN		(1 << 28)
/** RCC_APB2LPENR_SAI3LPEN SAI3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB2LPENR_SAI3LPEN		(1 << 24)
/** RCC_APB2LPENR_SAI2LPEN SAI2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB2LPENR_SAI2LPEN		(1 << 23)
/** RCC_APB2LPENR_SAI1LPEN SAI1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB2LPENR_SAI1LPEN		(1 << 22)
/** RCC_APB2LPENR_SPI5LPEN SPI5 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB2LPENR_SPI5LPEN		(1 << 20)
/** RCC_APB2LPENR_TIM17LPEN TIM17 peripheral clock enable during CSleep mode **/
#define RCC_APB2LPENR_TIM17LPEN		(1 << 18)
/** RCC_APB2LPENR_TIM16LPEN TIM16 peripheral clock enable during CSleep mode **/
#define RCC_APB2LPENR_TIM16LPEN		(1 << 17)
/** RCC_APB2LPENR_TIM15LPEN TIM15 peripheral clock enable during CSleep mode **/
#define RCC_APB2LPENR_TIM15LPEN		(1 << 16)
/** RCC_APB2LPENR_SPI4LPEN SPI4 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB2LPENR_SPI4LPEN		(1 << 13)
/** RCC_APB2LPENR_SPI1LPEN SPI1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB2LPENR_SPI1LPEN		(1 << 12)
/** RCC_APB2LPENR_USART6LPEN USART6 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB2LPENR_USART6LPEN		(1 << 5)
/** RCC_APB2LPENR_USART1LPEN USART1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB2LPENR_USART1LPEN		(1 << 4)
/** RCC_APB2LPENR_TIM8LPEN TIM8 peripheral clock enable during CSleep mode **/
#define RCC_APB2LPENR_TIM8LPEN		(1 << 1)
/** RCC_APB2LPENR_TIM1LPEN TIM1 peripheral clock enable during CSleep mode **/
#define RCC_APB2LPENR_TIM1LPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb4lpenr APB4LPENR RCC APB4 Sleep Clock Register
@{*/

/** RCC_APB4LPENR_SAI4LPEN SAI4 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB4LPENR_SAI4LPEN		(1 << 21)
/** RCC_APB4LPENR_RTCAPBLPEN RTC APB Clock Enable During CSleep Mode **/
#define RCC_APB4LPENR_RTCAPBLPEN		(1 << 16)
/** RCC_APB4LPENR_VREFLPEN VREF peripheral clock enable during CSleep mode **/
#define RCC_APB4LPENR_VREFLPEN		(1 << 15)
/** RCC_APB4LPENR_COMP12LPEN COMP1/2 peripheral clock enable during CSleep mode **/
#define RCC_APB4LPENR_COMP12LPEN		(1 << 14)
/** RCC_APB4LPENR_LPTIM5LPEN LPTIM5 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB4LPENR_LPTIM5LPEN		(1 << 12)
/** RCC_APB4LPENR_LPTIM4LPEN LPTIM4 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB4LPENR_LPTIM4LPEN		(1 << 11)
/** RCC_APB4LPENR_LPTIM3LPEN LPTIM3 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB4LPENR_LPTIM3LPEN		(1 << 10)
/** RCC_APB4LPENR_LPTIM2LPEN LPTIM2 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB4LPENR_LPTIM2LPEN		(1 << 9)
/** RCC_APB4LPENR_I2C4LPEN I2C4 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB4LPENR_I2C4LPEN		(1 << 7)
/** RCC_APB4LPENR_SPI6LPEN SPI6 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB4LPENR_SPI6LPEN		(1 << 5)
/** RCC_APB4LPENR_LPUART1LPEN LPUART1 Peripheral Clocks Enable During CSleep Mode **/
#define RCC_APB4LPENR_LPUART1LPEN		(1 << 3)
/** RCC_APB4LPENR_SYSCFGLPEN SYSCFG peripheral clock enable during CSleep mode **/
#define RCC_APB4LPENR_SYSCFGLPEN		(1 << 1)

/**@}*/

/** @defgroup rcc_c1_rsr C1RSR RCC Reset Status Register
@{*/

